# Taps
tap "homebrew/completions"
tap "homebrew/dupes"
tap "homebrew/php"
tap "homebrew/versions"
tap "neovim/neovim"
tap "rogual/neovim-dot-app"
tap "yudai/gotty"

# Packages
brew "ack"
brew "awscli"
brew "ccat"
brew "coreutils"
brew "dos2unix"
brew "editorconfig"
brew "gem-completion"
brew "git"
brew "gotty"
brew "grc"
brew "htop-osx"
brew "imagemagick"
brew "macvim", args: ["--with-lua", "--without-python", "--with-python3"]
brew "mysql"
brew "neovim"
brew "neovim-dot-app", args: ["HEAD"]
brew "nginx"
brew "node"
brew "php56"
brew "php56-mcrypt"
brew "python"
brew "rbenv"
brew "rbenv-gemset"
brew "ruby-build"
brew "ruby-completion"
brew "tidy-html5"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unrar"
brew "unzip"
brew "vim", args: ["--with-lua", "--without-python", "--with-python3"]
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zsh-syntax-highlighting"
